article = {
  author:`Pat Mitchell`,
  date:`Wednesday August 14, 2022`,
  previousArticle:null,
  previousArticleTitle:null,
  nextArticle:null,
  nextArticleTitle:null,
  title:`Comicbook Collection Tracker - Introduction`,
  body:`
  <p>I enjoy collecting individual issues of comics, but it eventually
  becomes necessary to track the comics in my collection. I've accidentally
  bought comics I already own and skipped issues I thought I had. The problem
  is further compounded while buying multiple issues on eBay where I don't
  have complete control of which issues I will get and nature of the limited
  time offers doesn't afford me the greatest luxury.</p>

  <p>I looked online to see if there was any existing software for comic
  collections and they do exist. The issue was that they were paid services
  for something that I was comfortable making a physical list for. Some of
  them even had monthly subscriptions.</p>

  <p>In the end, I decided that making my own software was the better choice.
  I believe this project originally started while I was teaching myself computer
  graphics and I wanted a break from linear algebra and try making a database
  without using SQL or any server because this project was taking place at work
  (during lunch breaks) where I'm not allowed to install non-work related programs.</p>

  <p>Using the work computers created another limitation. The browser would
  refuse to read any local files that aren't javascript, html, or css without
  throwing a CORS error, so the solution for the database is a json file that
  contains  information a collector would want to see while browsing their
  collection like the series name, issue number, date published, credits, etc.</p>

  <p>All the entries are organized alphabetically by series name. Clicking the
  name of the series drops down a list of all the issues (organized by number)
  where the user can select the issue and the information in the database will be
  displayed in the main panel. The user can also save their collection locally
  or load a separate collection. Adding a comic to the collection is also as easy
  as tapping the "New" button and entering all the data for the comic.</p>

  <p>The design of the app is based on older Windows desktop apps because the
  computers at work were still running Windows XP and I wanted to emulate the
  design.</p>

  <p>I considered removing the save and load features for the "portfolio version",
  but opted to keep it.</p>

  <p><a href="cbctracker.html" style="text-decoration: underline;">Here's a link
  to the Comicbook Tracker app.</a> It comes preloaded with a decent portion of
  my collection. You can add comics or curate your own collection.</p>

  <p>There is an issue with displaying the cover image on Github Pages. I did
  not want to store the cover image locally to save on hard drive space, so the
  page is supposed to grab the image from a comic book wiki page. It works
  while running the page locally, but returns a 404 error while running on github.
  I don't know what is causing the issue. The link is correct because you can
  right click -> open image to new tab and the correct cover image appears.</p>
  `,
};
